"""
Разместите файл в папке вашего проекта. Для импорта функций примените
> from  calcfeelib import calcfee
"""

'''
Для иска       1000 пошлина составит 2000
Для иска       2000 пошлина составит 2000
Для иска       2001 пошлина составит 2000
Для иска      90000 пошлина составит 3600
Для иска     100000 пошлина составит 4000
Для иска     100001 пошлина составит 4000
Для иска     190000 пошлина составит 6700
Для иска     200000 пошлина составит 7000
Для иска     200001 пошлина составит 7000
Для иска     990000 пошлина составит 22800
Для иска    1000000 пошлина составит 23000
Для иска    1000001 пошлина составит 23000
Для иска    1990000 пошлина составит 32900
Для иска    2000000 пошлина составит 33000
Для иска    2000001 пошлина составит 33000
Для иска    4000000 пошлина составит 43000
'''

def calcfee(isk):
    '''
    Вычисляем размер госпошлины от суммы иска для арбитражного суда
    :param isk: float
    :return: int
    '''
    if isk <= 100000:
        res = isk * 0.04
        if res < 2000:
            res = 2000
    elif 100001 <= isk <= 200000:
        res = (isk - 100000) * 0.03 + 4000
    elif 200001 <= isk <= 1000000:
        res = (isk - 200000) * 0.02 + 7000
    elif 1000001 <= isk <= 2000000:
        res = (isk - 1000000) * 0.01 + 23000
    elif isk >= 2000001:
        res = (isk - 2000000) * 0.005 + 33000
        if res > 200000:
            res = 200000
    # return int(res + (0.5 if res > 0 else -0.5)) # округление float -> int делается корректно
    return int(res)

def calcfee2(isk):
    if isk <= 100000:
        tmp = isk*0.04
        res = tmp if tmp > 2000 else 2000
    elif isk <= 200000:
        res = 4000 + (isk-100000) * 0.03
    elif isk <= 1000000:
        res = 7000 + (isk-200000) * 0.02
    elif isk <= 2000000:
        res = 23000 + (isk-1000000) * 0.01
    else:
        tmp = 33000 + (isk-2000000)*0.005
        res = tmp if tmp < 2000000 else 200000
    return int(res)

def calcfee3(isk):
    feemin, feemax = 2000, 200000
    fees = {100000: (0, 0.04, 0), 200000: (4000, 0.03, 100000), 1000000: (7000, 0.02, 200000),
         2000000: (23000, 0.01, 1000000), float('inf'): (33000, 0.005, 2000000)
        }
    k = min(*fees, key=lambda x: x<isk)
    tmp = fees[k][0] + (isk-fees[k][2]) * fees[k][1]
    if k == min(*fees):
        res = tmp if tmp > feemin else feemin
    elif k == max(*fees):
        res = tmp if tmp < feemax else feemax
    else:
        res = tmp
    return int(res)


if __name__ == '__main__':

    checkfee = [1000, 2000, 2001,
                90000, 100000,100001,
                190000, 200000, 200001,
                990000, 1000000, 1000001,
                1990000, 2000000, 2000001,
                4000000]
    for x in checkfee:
        print(f'Для иска {x:>10} пошлина составит {calcfee3(x)}')

    exit(0)